{
  "About": {
    "Name": "Tidankay Sesay",
    "Currently": "Computer Science Student",
    "Headshot": "IMG_4339.jpeg",
    "Thumbnail": "IMG_4339.jpeg",
    "AboutText": "Hi, I am Tidankay Sesay. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies."
  },
  "Contact": {
    "EMail": "sesayt@spu.edu",
    "Phone": "",
    "Portfolio": "Tidasesay2.github.io",
    "LinkedIn": "https://linkedin.com",
    "GitHub": "https://github.com/csc3310-fall2023/scheme-Tidasesay2"
  },
  "Experience": {
    "ExperienceText": "Hi, I am Tidankay Sesay. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>My journey in computer science began with a fascination for technology and problem-solving, which led me to pursue a degree in this field. I have worked on numerous challenging programming projects and thrive in collaborative environments where I can contribute my expertise and learn from my peers. As an incoming senior, I am currently interning with the 'How's Life?' mental health app, where I am enhancing my programming skills and contributing to meaningful change.<br><br>Beyond the classroom, I actively engage in extracurricular activities related to computer science, including hackathons, coding competitions, and open-source contributions. I believe in the importance of continuous learning and seek out opportunities to explore new technologies and methodologies. This journey has shaped me into a dedicated and innovative computer science enthusiast, ready to tackle new challenges and make a positive impact in the tech world.",
    "School": "Seattle Pacific University",
    "Major": "Computer Science",
    "Graduation": "June 2025",
    "EducationText": "I am currently pursuing my undergraduate degree in Computer Science at Seattle Pacific University. As an incoming senior, I have dedicated myself to mastering various aspects of computer science, with a particular focus on C++ programming. Throughout my academic journey, I have actively participated in numerous projects and coursework that have honed my skills in software development, algorithms, and data structures.<br><br>In addition to my formal education, I have sought out opportunities to expand my knowledge through extracurricular activities such as hackathons, coding competitions, and open-source contributions. These experiences have not only enriched my understanding of computer science but also allowed me to apply my skills in real-world scenarios, fostering a deeper appreciation for the field.<br><br>Currently, I am interning with the 'How's Life?' mental health app, where I am applying my academic knowledge to practical projects, further enhancing my programming skills, and contributing to meaningful technological advancements. My education at Seattle Pacific University has provided a strong foundation, preparing me to excel in the ever-evolving world of technology.",
    "Employment": "Seattle Pacific University",
    "Role": "Intern at How's Life?",
    "EmploymentText": "I am currently interning with the 'How's Life?' mental health app, where I am gaining invaluable experience in software development and programming. In this role, I am responsible for enhancing and improving the app's functionality, working closely with a team of dedicated professionals. This internship has provided me with a unique opportunity to apply my academic knowledge to real-world projects, develop my programming skills, and make a positive impact on mental health through technology.<br><br>In addition to my current internship, I have participated in various freelance projects and collaborative programming efforts. These experiences have allowed me to work on diverse projects, ranging from small-scale applications to larger, more complex systems. Through these roles, I have developed strong problem-solving abilities, effective communication skills, and a deep understanding of software development practices.<br><br>My employment journey has been characterized by a continuous desire to learn and grow within the field of computer science. Each role I have undertaken has contributed to my development as a skilled and adaptable professional, ready to tackle new challenges and contribute to innovative technological solutions.",
    "Skills": ["C++", "JavaScript", "Node", "CSS", "HTML", "Python", "Scheme", "Rust"],
    "SkillsText": "Throughout my academic and professional journey, I have cultivated a diverse set of skills that equip me to excel in the field of computer science. My proficiency in C++ programming is complemented by a strong foundation in other programming languages such as Python, Java, and JavaScript. This versatility allows me to approach problems from multiple angles and develop robust, efficient solutions.<br><br>In addition to my programming capabilities, I possess a solid understanding of software development methodologies, including Agile and Scrum. These methodologies have shaped my approach to project management and teamwork, ensuring that I can contribute effectively in collaborative environments.<br><br>My experience with data structures and algorithms has further enhanced my problem-solving abilities, enabling me to tackle complex challenges with confidence. I am also skilled in web development, having worked on various projects involving HTML, CSS, and modern frameworks such as React and Angular.<br><br>Beyond technical skills, I pride myself on my strong communication and interpersonal skills. These have been crucial in my roles as a team member and leader, allowing me to articulate ideas clearly, listen actively, and collaborate effectively.<br><br>Currently, I am enhancing my skills through an internship with the 'How's Life?' mental health app, where I am applying my knowledge to real-world projects and gaining valuable hands-on experience. My commitment to continuous learning and growth drives me to stay updated with the latest technologies and best practices in the industry, ensuring that I am always prepared to meet new challenges head-on.",
    "Resume": "student-resume.pdf"
  },
  "Project1": {
    "Title": "Python Webcrawler",
    "Desc": "The Python web crawler is a sophisticated tool designed to navigate and extract information from different websites, allowing for both breadth and depth in its search. The crawler is equipped with a filtering mechanism that enables it to focus on specific types of content or data, ensuring efficient and relevant data collection.",
    "GitHubRepo": "https://github.com/csc3430-winter2024/web-crawler-term-and-graph-13.git",
    "MainImage": "https://private-user-images.githubusercontent.com/97266557/313088463-d1920db3-46eb-4141-80cb-3137e601f300.png?jwt=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJnaXRodWIuY29tIiwiYXVkIjoicmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbSIsImtleSI6ImtleTUiLCJleHAiOjE3MTgzNDc3ODEsIm5iZiI6MTcxODM0NzQ4MSwicGF0aCI6Ii85NzI2NjU1Ny8zMTMwODg0NjMtZDE5MjBkYjMtNDZlYi00MTQxLTgwY2ItMzEzN2U2MDFmMzAwLnBuZz9YLUFtei1BbGdvcml0aG09QVdTNC1ITUFDLVNIQTI1NiZYLUFtei1DcmVkZW50aWFsPUFLSUFWQ09EWUxTQTUzUFFLNFpBJTJGMjAyNDA2MTQlMkZ1cy1lYXN0LTElMkZzMyUyRmF3czRfcmVxdWVzdCZYLUFtei1EYXRlPTIwMjQwNjE0VDA2NDQ0MVomWC1BbXotRXhwaXJlcz0zMDAmWC1BbXotU2lnbmF0dXJlPTY3ZGMzYjhkZDE0MGI3NTg2YmQ1YzQ1NTg3N2MxYWZkMzc5Yjc5ZTQ3NjYxOWZlNWVlNTQxMzc3ZTE3ZWUwMGQmWC1BbXotU2lnbmVkSGVhZGVycz1ob3N0JmFjdG9yX2lkPTAma2V5X2lkPTAmcmVwb19pZD0wIn0.hwKuclhxU61YgVdDaHK4YQ0sRfgpuiAGPGpvRJywrro",
    "DetailImages": ["P1Detail1.png", "P1Detail2.png", "P1Detail3.png"]
  },
  "Project2": {
    "Title": "Interesting Project 2",
    "Desc": "This is a description of Project Two.<br><br>It also has a GitHub repo and more details shown in screenshots.",
    "GitHubRepo": "https://github.com",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png", "P2Detail2.png", "P2Detail3.png", "P2Detail4.png"]
  },
  "Project3": {
    "Title": "Interesting Project 3",
    "Desc": "This is a description of Project Three.<br><br>It does not have a GitHub repo or any additional screenshots.",
    "GitHubRepo": "",
    "MainImage": "P3Main.png",
    "DetailImages": []
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}

